src/InformationRegisters/ПриоритетВыгрузкиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПриоритетВыгрузкиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ПриоритетВыгрузкиОбъектов/Ext/ManagerModule.bsl
Функция ПолучитьТаблицуПриоритетов(Узел) Экспорт
	
	лОбъектыМетаданных = Новый ТаблицаЗначений;
	лОбъектыМетаданных.Колонки.Добавить("ОбъектМетаданных");
	лОбъектыМетаданных.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
	лОбъектыМетаданных.Колонки.Добавить("Поток", Новый ОписаниеТипов("Число"));
	
	Если Не ЗначениеЗаполнено(Узел) Тогда
		Возврат лОбъектыМетаданных
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПриоритетВыгрузкиОбъектов.Объект,
	                      |	ПриоритетВыгрузкиОбъектов.Приоритет,
						  |	ПриоритетВыгрузкиОбъектов.Поток
	                      |ИЗ
	                      |	РегистрСведений.ПриоритетВыгрузкиОбъектов КАК ПриоритетВыгрузкиОбъектов
	                      |ГДЕ
	                      |	ПриоритетВыгрузкиОбъектов.Узел = &Узел");
	Запрос.УстановитьПараметр("Узел", Узел);
	Результат = Запрос.Выполнить();
		
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		лМетаданные = Метаданные.НайтиПоПолномуИмени(Выборка.Объект);
		Если Не лМетаданные = Неопределено Тогда
			НоваяСтрока = лОбъектыМетаданных.Добавить();
			НоваяСтрока.ОбъектМетаданных = лМетаданные;
			НоваяСтрока.Приоритет = Выборка.Приоритет;
			НоваяСтрока.Поток = Выборка.Поток;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат лОбъектыМетаданных
	
КонецФункции
